olliw42/stm32ll-lib/src/stdstm32-uarte.h
#ifdef UARTE_TC_CALLBACK
  if ((usart_sr & FLAG_SR_TC) && LL_USART_IsEnabledIT_TC(UARTE_UARTx)) {
    LL_USART_DisableIT_TC(UARTE_UARTx);
    LL_USART_ClearFlag_TC(UARTE_UARTx);
    UARTE_TC_CALLBACK();
  }
#endif
#ifdef UARTE_IDLE_CALLBACK
  if ((usart_sr & FLAG_SR_IDLE) && LL_USART_IsEnabledIT_IDLE(UARTE_UARTx)) {
    LL_USART_DisableIT_IDLE(UARTE_UARTx);
    LL_USART_ClearFlag_IDLE(UARTE_UARTx);
    UARTE_IDLE_CALLBACK();
  }
#endif
#endif
}

#endif // defined UARTE_USE_RX || defined UARTE_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UARTE_USE_TX

uint16_t uarte_putc(char c)
{
#ifndef UARTE_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UARTE_UARTx)) {}
  LL_USART_TransmitData8(UARTE_UARTx, c);
  return 1;
#else
  uint16_t next = (uarte_txwritepos + 1) & UARTE_TXBUFSIZEMASK;
  if (uarte_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uarte_txbuf[next] = c;
    uarte_txwritepos = next;
    LL_USART_EnableIT_TXE(UARTE_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uarte_puts(const char *s)
{
  while (*s) {
    uarte_putc(*s);
    s++;
  }
}


void uarte_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uarte_putc(buf[i]);
}


#ifdef UARTE_USE_TX_ISR
uint16_t uarte_tx_notfull(void)
{
  uint16_t next = (uarte_txwritepos + 1) & UARTE_TXBUFSIZEMASK;
  return (uarte_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uarte_tx_isempty(void)
{
  if (uarte_txwritepos == uarte_txreadpos) return 1;
  return 0;
}


static inline void uarte_tx_flush(void)
{
  uarte_txwritepos = uarte_txreadpos = 0;
}
#else
static inline void uarte_tx_flush(void) {}
#endif

#endif // defined UARTE_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTE_USE_RX

static inline uint16_t uarte_rx_available(void)
{
  if (uarte_rxwritepos == uarte_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uarte_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uarte_rxwritepos - (int16_t)uarte_rxreadpos;
  return (d < 0) ? d + (UARTE_RXBUFSIZEMASK + 1) : d;
}


char uarte_getc(void)
{
  while (uarte_rxwritepos == uarte_rxreadpos) {};
  uarte_rxreadpos = (uarte_rxreadpos + 1) & UARTE_RXBUFSIZEMASK;
  return uarte_rxbuf[uarte_rxreadpos];
}


static inline char uarte_lookatnextc(void)
{
  return uarte_rxbuf[(uarte_rxreadpos + 1) & UARTE_RXBUFSIZEMASK];
}


static inline void uarte_rx_flush(void)
{
  uarte_rxwritepos = uarte_rxreadpos = 0;
}

#endif // defined UARTE_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uarte_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTE_USE_LPUART1 || defined UARTE_USE_LPUART1_PA2PA3 || defined UARTE_USE_LPUART1_PC1PC0)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

  LL_USART_Init(UARTE_UARTx, &UART_InitStruct);
#else
LL_LPUART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_LPUART_DATAWIDTH_9B : LL_LPUART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  UART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;

  LL_LPUART_Init(UARTE_UARTx, &UART_InitStruct);
#endif
}


void uarte_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTE_USE_LPUART1 || defined UARTE_USE_LPUART1_PA2PA3 || defined UARTE_USE_LPUART1_PC1PC0)
  LL_USART_Disable(UARTE_UARTx); // must be disabled to configure some registers
  _uarte_initprotocol(baud, parity, stopbits);
  LL_USART_Enable(UARTE_UARTx);
#else
  LL_LPUART_Disable(UARTE_UARTx); // must be disabled to configure some registers
  _uarte_initprotocol(baud, parity, stopbits);
  LL_LPUART_Enable(UARTE_UARTx);
#endif
}


void uarte_setbaudrate(uint32_t baud)
{
  uarte_setprotocol(baud, XUART_PARITY_NO, UART_STOPBIT_1);
}


void uarte_tx_enablepin(FunctionalState flag)
{
#ifdef UARTE_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTE_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTE_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTE_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uarte_rx_enableisr(FunctionalState flag)
{
#ifdef UARTE_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTE_UARTx);
#endif
    LL_USART_ReceiveData8(UARTE_UARTx); // read DR to clear RXNE and error flags
    LL_USART_EnableIT_RXNE(UARTE_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTE_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTE_UARTx);
#endif
  }
#endif
}


void uarte_init_isroff(void)
{
  LL_USART_Disable(UARTE_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTE_UARTx);
#ifdef STM32F1
#if defined UARTE_USE_UART1_PB6PB7
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UARTE_USE_UART2_PD5PD6
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UARTE_USE_UART3_PC10PC11
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

